<template>
    <div class="vopros">
      <h2>
        Анкета изучения мнений граждан с инвалидностью о соблюдении их прав в Российской Федерации
      </h2>
      <p>Здравствуйте!</p>
      <p>
        Администрация исполнительного органа государственной власти субъекта Российской Федерации
        проводит изучение провозглашенных Конвенцией о правах инвалидов прав инвалидов и возможностей
        их соблюдения в целях принятия необходимых региональных мер по обеспечению полной реализации
        инвалидами всех прав и свобод человека. Просим Вас принять участие в анонимном опросе,
        результаты которого будут использованы в обобщенном виде. Для заполнения анкеты прочтите
        вопросы сами или с помощью других лиц и возможные ответы на них. Обведите номер того варианта
        (или вариантов), который соответствует Вашему мнению, либо укажите свой вариант ответа в графе
        «Другое». В вопросах-таблицах необходимо указать только одну позицию по каждой строке.
        Вопросы, в которых необходимо отметить несколько вариантов ответа, отмечены в анкете
        специальной фразой. Внимание в случае заполнения анкеты членом семьи инвалида, заполняются
        сведения и ответы на вопросы об инвалиде.
      </p>
      <p>Заранее благодарим за помощь и за Ваши искренние ответы!</p>
      <div>
        <br />
        <h3>Кто проходит опрос</h3>
        <select v-model="val" name="person">
          <br />
          <option>Взрослый</option>
          <option>Ребёнок</option>
        </select>
  
        <div class="button">
          <input type="submit" value="Далее" @click.prevent="goToQuestions" />
        </div>
      </div>
    </div>
  </template>
  
  <style scoped>
  div {
    text-align: center;
  }
  </style>
  
<script>
export default {
  name: 'Home',
  data() {
    return {
      val: ""
    }
  },
  methods: {
    goToQuestions() {
      if(this.val == "Взрослый"){
        this.$router.push('/questions/1');
      }
      else{
        this.$router.push('/questions/2');
      }
    }
  }
}
</script>